#include<bits/stdc++.h>
using namespace std;
#define int long long
const int N = 2e5+10, inf = 1e9, mod = 1e9+7;
int n,m;

signed main() {
    // 0 拿球问题
    /*
        袋子里一共a个白球，b个黑球，每次从袋子里拿2个球，每个球每次被拿出机会均等
        如果拿出的是2个白球、或者2个黑球，那么就往袋子里重新放入1个白球
        如果拿出的是1个白球和1个黑球，那么就往袋子里重新放入1个黑球
        那么最终袋子里一定会只剩1个球，请问最终的球是黑的概率是多少？用a和b来表达这个概率。

        // 把a个白球和b个黑球异或，得出结果c（0/1），若b为偶数，偶数个1异或只能0，故最终求是黑的概率为0%；若b为奇数，奇数个1异或只能为1，故最终是黑的概率为100%
    */

    // 1 交换两个数
    int a = 114;
    int b = 514;
    cout << "交换前" << a << " " << b << endl;
    a = a^b;
    b = a^b;
    a = a^b;
    cout << "交换后" << a << " " << b << endl;

    return 0;
}

